app/Services/HelperService.php

    public static function getSettingData($type){
        $settingQueryData = Setting::where('type',$type)->select('type','data')->first();
---
select `type`, `data` from `settings` where `type` = 'timezone' limit 1