app/Http/Controllers/Frontend/FrontendController.php

select `type`, `data` from `settings` where `type` in ('company_name', 'currency_symbol', 'web_logo', 'company_email', 'company_tel1', 'facebook_id', 'instagram_id', 'twitter_id', 'youtube_id', 'playstore_id', 'appstore_id', 'company_address', 'system_color')
---
    public static function settings(array $keys = []): array
    {
        return Cache::remember('bw_settings_' . md5(implode(',', $keys)), 3600, function () use ($keys) {
            $q = Setting::select('type', 'data');
            if ($keys) $q->whereIn('type', $keys);
            return $q->get()->pluck('data', 'type')->toArray();

select * from `languages` where `status` = 1 order by `id` asc
---
    private static function activeLangs()
    {
        try {
            return Cache::remember('bw_active_langs_full', 3600, function () {
                return DB::table('languages')->where('status', 1)->orderBy('id')->get();

select * from `categories` where `status` = 1
---
    public function home()
    {
        // Featured properties
        $featured = $this->propQuery()->where('is_premium', 1)
            ->orderByDesc('total_click')->take(8)->get();
        if ($featured->isEmpty()) {
            $featured = $this->propQuery()->orderByDesc('created_at')->take(8)->get();
        }

        // Categories with property count via DB (avoids relationship name dependency)
        $categories = Category::where('status', 1)->with('translations')
            ->orderBy('sequence')->take(6)->get();
        $countQ = DB::table('propertys')
            ->select('category_id', DB::raw('COUNT(*) as cnt'))
            ->where('status', 1)->where('request_status', 'approved');
        $this->applyDemoFilter($countQ, 'propertys');
        $counts = $countQ->groupBy('category_id')->pluck('cnt', 'category_id');
        $categories->each(fn($c) => $c->property_count = $counts[$c->id] ?? 0);