app/Http/Controllers/SiteSettingsController.php

    public static function load(string $key = null)
    {
        $all = Cache::remember('bw_site_settings', 1800, function () {
            $defaults = self::defaults();
            $keys = ['sections','listing_filters','results_per_page','default_sort',
                     'card_fields','notif_templates','seo','announcement'];
            foreach ($keys as $k) {
                try {
                    $raw = Setting::where('type', 'site_'.$k)->value('data');
---
select `data` from `settings` where `type` = 'site_sections' limit 1