app/Models/parameter.php

    public function getTranslatedOptionValueAttribute()
    {
        $languageCode = request()->header('Content-Language') ?? app()->getLocale();

        if (empty($languageCode)) {
            return $this->getSimpleOptionValues();
        }

        // Get language ID for the code
        $languageId = cache()->remember("language_id_{$languageCode}", 3600, function() use ($languageCode) {
            return Language::where('code', $languageCode)->value('id');
---
select `id` from `languages` where `code` = 'en' limit 1